Конфигурация/InformationRegisters/Рейтинги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Рейтинги</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Рейтинг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеРейтинга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияРейтингов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрогнозРейтинга</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПрогнозыРейтингов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПереходаВАрхив</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УровеньРейтинга</Name>
					<Comment>Заполняется автоматически</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Агрегатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РейтинговоеАгентство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РейтинговыеАгентства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШкалыРейтинговыхАгентств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СубъектыРейтингов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/Рейтинги/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(Запись.ЗначениеРейтинга) Тогда
			Продолжить;
		КонецЕсли;
		
		Запись.УровеньРейтинга = РегистрыСведений.Рейтинги.ПолучитьУровеньРейтинга(Запись.РейтинговоеАгентство, Запись.Рейтинг);
		
		Если Запись.УровеньРейтинга = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить уровень рейтинга '" + Запись.Рейтинг + "' агентства '" + Запись.РейтинговоеАгентство + "' за период '" + Запись.Период + "'",,,, Отказ);
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
